Revit 2027 API
PlanViewRange.GetLevelId Method
 Get the element id of the level for a View Depth plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetLevelId(
	PlanViewPlane planViewPlane
)
Public Function GetLevelId (
	planViewPlane As PlanViewPlane
) As ElementId
public:
ElementId^ GetLevelId(
	PlanViewPlane planViewPlane
)
member GetLevelId :
        planViewPlane : PlanViewPlane -> ElementId
Parameters
planViewPlane PlanViewPlane
 The plane whose level will be returned
Return Value
ElementId
 Id of the level
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PlanViewRange Class
Autodesk.Revit.DB Namespace